doc/r2r_filespecs.org
* Introduction
This file provides descriptions of vocabluary and application files used by ECFM
* /shipdata/cruise_maint
** logbooks.csv - List of logbooks served by elog-dev server
Created:'maintained by hand
Sample Records:
|-------------+------------+-----------------------------------------------+----------------------------------------------------|
| Logbook     | CruiseYear | ConfigFile                                    | LogbbookDir                                        |
|-------------+------------+-----------------------------------------------+----------------------------------------------------|
| AE1211-SE   |       2012 | shipdata/AE-X1211/r2r/eventlog/elog/elogd.cfg | shipdata/archive/2012/elog/logbooks/ae/AE1211-SE   |
| al130801-SE |       2013 | shipdata/al130801/r2r/eventlog/elog/elogd.cfg | shipdata/archive/2013/elog/logbooks/al/al130801-SE |
| AT18-06-DS  |       2011 | shipdata/at18-06/r2r/eventlog/elog/elogd.cfg  | shipdata/archive/2011/elog/logbooks/at/AT18-06-DS  |
|-------------+------------+-----------------------------------------------+----------------------------------------------------|

Column Descriptions:
- *Logbook* - Name of the logbook (as designated in the configuration file)                          
- *CruiseYear* - Year the cruise associated with the logbook took place in                              
- *ConfigFile* - Last version of the configfile (elogd.cfg) that was used for logbook creation          
- *LogbookDir* - Directory on elog-dev that the .log (and associated) files for this logbook are stored 

* /shipddata/cruise_maint/bin
This is a description of the scripts found in the /shipdata/cruise_maint/bin directory.
General naming convention is <thing-acting-on>_<thing-done>.<ext>
** cruise_toarchive - moves recently completed cruise eventlog to /shipdata/archive
** cruise_serve - makes archived cruise eventlog web-accessible on elog-dev.whoi.edu
** cruise_vocab - process vocab terms found in archived cruise eventlog
** cruise_assess - assess quality of archived cruise eventlog
** vocab_getNVS - put fresh copies of NVS vocabs in /shipdata/cruise_maint/vocabs
** vocab_getR2R - put fresh copies of R2R vocabs in /shipdata/cruise_maint/vocabs
** vocab_ecfmvoc - create new instruements.csv, actions.csv, etc file in /shipdata/cruise_maint/ecfmvoc
** logbook_listattr - given an elog attribute lists values assigned to that attribute during a cruise
* /shipdata/cruise_maint/ecfm_voc
** actions.csv - actions used in ECFM configs
Currently used to fillin the Action attribute in cruise logs
Created: *cat r2r_action_vocab.csv > actions.csv*
Sample Records:
|--------------+------------+---------------------------|
| ActionTerm   | ActionID   | ActionDescription         |
|--------------+------------+---------------------------|
| abort        | R2RE/1035  | Aborted device operations |
| cruiseEnd    | R2RE/1036  | Research cruise ended     |
|--------------+------------+---------------------------|

Column Descriptions:
- *ActionTerm* - term description goes here
- ActionID                              
- ActionDescription                     

** activitytype.tsv - obsolete or still used?
Obsolete? Not sure where this file came from
Created: *Obsolete?*
Sample Records:
|--------------+---------------------------------------------------------------------------|
| ActivityType | Description                                                               |
|--------------+---------------------------------------------------------------------------|
| abort        | device sampling has been aborted                                          |
| abortLine    | research vessel has aborted a line from one station (waypoint) to another |
| arrivePort   | research vessel has arrived in port                                       |
| calibrate    | device has been (re)calibrated                                            |
|--------------+---------------------------------------------------------------------------|

Column Descriptions:
- ActivityType
- Description

