doc/r2r_filespecs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>r2r_filespecs</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="r2r_filespecs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-14T07:33-0500"/>
<meta name="author" content="Drumbeat"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">r2r_filespecs</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 /shipdata/cruise_maint</a>
<ul>
<li><a href="#sec-2-1">2.1 logbooks.csv - List of logbooks served by elog-dev server</a></li>
</ul>
</li>
<li><a href="#sec-3">3 /shipddata/cruise_maint/bin</a>
<ul>
<li><a href="#sec-3-1">3.1 cruise_toarchive - moves recently completed cruise eventlog to /shipdata/archive</a></li>
<li><a href="#sec-3-2">3.2 cruise_serve - makes archived cruise eventlog web-accessible on elog-dev.whoi.edu</a></li>
<li><a href="#sec-3-3">3.3 cruise_vocab - process vocab terms found in archived cruise eventlog</a></li>
<li><a href="#sec-3-4">3.4 cruise_assess - assess quality of archived cruise eventlog</a></li>
<li><a href="#sec-3-5">3.5 vocab_getNVS - put fresh copies of NVS vocabs in /shipdata/cruise_maint/vocabs</a></li>
<li><a href="#sec-3-6">3.6 vocab_getR2R - put fresh copies of R2R vocabs in /shipdata/cruise_maint/vocabs</a></li>
<li><a href="#sec-3-7">3.7 vocab_ecfmvoc - create new instruements.csv, actions.csv, etc file in /shipdata/cruise_maint/ecfmvoc</a></li>
<li><a href="#sec-3-8">3.8 logbook_listattr - given an elog attribute lists values assigned to that attribute during a cruise</a></li>
</ul>
</li>
<li><a href="#sec-4">4 /shipdata/cruise_maint/ecfm_voc</a>
<ul>
<li><a href="#sec-4-1">4.1 actions.csv - actions used in ECFM configs</a></li>
<li><a href="#sec-4-2">4.2 activitytype.tsv - obsolete or still used?</a></li>
<li><a href="#sec-4-3">4.3 instactionmap.csv - what actions can instruments perform?</a></li>
<li><a href="#sec-4-4">4.4 instruments.csv - instruments used in ECFM configs</a></li>
<li><a href="#sec-4-5">4.5 organization.tsv - organizations used in ECFM configs</a></li>
<li><a href="#sec-4-6">4.6 person.tsv - participants list used in ECFM configs</a></li>
<li><a href="#sec-4-7">4.7 vessel.tsv - vessels used in ECFM configs</a></li>
<li><a href="#sec-4-8">4.8 termlist_actions.csv - terms to be included in actions.csv</a></li>
<li><a href="#sec-4-9">4.9 termlist_instruments.csv - terms to be included in instruments.csv</a></li>
</ul>
</li>
<li><a href="#sec-5">5 /shipdata/cruise_maint/vocabs</a>
<ul>
<li><a href="#sec-5-1">5.1 nvs_inst_vocab.csv - NVS-defined instrument terms curr used in ECFM</a></li>
<li><a href="#sec-5-2">5.2 nvs_action_vocab.csv - NVS-defined action terms curr used in ECFM (does not exist yet)</a></li>
<li><a href="#sec-5-3">5.3 r2r_inst_vocab.csv - R2R-defined instrument terms curr used in ECFM</a></li>
<li><a href="#sec-5-4">5.4 r2r_action_vocab.csv - R2R-defined action terms used in ECFM</a></li>
<li><a href="#sec-5-5">5.5 r2r_person_vocab.csv - R2R-defined people terms used in ECFM</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Vocabulary term candidate files</a>
<ul>
<li><a href="#sec-6-1">6.1 nvs_inst_candidates.csv</a></li>
<li><a href="#sec-6-2">6.2 nvs_action_candidates.csv</a></li>
<li><a href="#sec-6-3">6.3 r2r_inst_candidates.csv</a></li>
<li><a href="#sec-6-4">6.4 r2r_action_candidates.csv</a></li>
<li><a href="#sec-6-5">6.5 r2r_person_candidates.csv</a></li>
<li><a href="#sec-6-6">6.6 r2r_organization_candidates.csv</a></li>
<li><a href="#sec-6-7">6.7 r2r_instactionmap_candidates.csv</a></li>
</ul>
</li>
<li><a href="#sec-7">7 /shipdata/cruise_maint/cruises/&lt;cruiseid&gt;</a>
<ul>
<li><a href="#sec-7-1">7.1 elogd.cfg - latest cruise elogd.cfg</a></li>
<li><a href="#sec-7-2">7.2 ecfm_cruisemeta.csv - cruise metadata from elogd.cfg</a></li>
<li><a href="#sec-7-3">7.3 ecfm_instruments.csv - instruments from elogd.cfg</a></li>
<li><a href="#sec-7-4">7.4 ecfm_actions.csv - actions from elogd.cfg</a></li>
<li><a href="#sec-7-5">7.5 ecfm_person.csv - persons from elogd.cfg</a></li>
<li><a href="#sec-7-6">7.6 novoc_actions.csv - actions not in NVS or R2R vocabs</a></li>
<li><a href="#sec-7-7">7.7 novoc_instruments.csv - instruments in NVS or R2R vocabs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>This file provides descriptions of vocabluary and application files used by ECFM
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> /shipdata/cruise_maint</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> logbooks.csv - List of logbooks served by elog-dev server</h3>
<div class="outline-text-3" id="text-2-1">

<p>Created:'maintained by hand
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Logbook</th><th scope="col" class="right">CruiseYear</th><th scope="col" class="left">ConfigFile</th><th scope="col" class="left">LogbbookDir</th></tr>
</thead>
<tbody>
<tr><td class="left">AE1211-SE</td><td class="right">2012</td><td class="left">shipdata/AE-X1211/r2r/eventlog/elog/elogd.cfg</td><td class="left">shipdata/archive/2012/elog/logbooks/ae/AE1211-SE</td></tr>
<tr><td class="left">al130801-SE</td><td class="right">2013</td><td class="left">shipdata/al130801/r2r/eventlog/elog/elogd.cfg</td><td class="left">shipdata/archive/2013/elog/logbooks/al/al130801-SE</td></tr>
<tr><td class="left">AT18-06-DS</td><td class="right">2011</td><td class="left">shipdata/at18-06/r2r/eventlog/elog/elogd.cfg</td><td class="left">shipdata/archive/2011/elog/logbooks/at/AT18-06-DS</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li><b>Logbook</b> - Name of the logbook (as designated in the configuration file)                          
</li>
<li><b>CruiseYear</b> - Year the cruise associated with the logbook took place in                              
</li>
<li><b>ConfigFile</b> - Last version of the configfile (elogd.cfg) that was used for logbook creation          
</li>
<li><b>LogbookDir</b> - Directory on elog-dev that the .log (and associated) files for this logbook are stored 
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> /shipddata/cruise_maint/bin</h2>
<div class="outline-text-2" id="text-3">

<p>This is a description of the scripts found in the /shipdata/cruise_maint/bin directory.
General naming convention is &lt;thing-acting-on&gt;_&lt;thing-done&gt;.&lt;ext&gt;
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> cruise_toarchive - moves recently completed cruise eventlog to /shipdata/archive</h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> cruise_serve - makes archived cruise eventlog web-accessible on elog-dev.whoi.edu</h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> cruise_vocab - process vocab terms found in archived cruise eventlog</h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> cruise_assess - assess quality of archived cruise eventlog</h3>
<div class="outline-text-3" id="text-3-4">

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> vocab_getNVS - put fresh copies of NVS vocabs in /shipdata/cruise_maint/vocabs</h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> vocab_getR2R - put fresh copies of R2R vocabs in /shipdata/cruise_maint/vocabs</h3>
<div class="outline-text-3" id="text-3-6">

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> vocab_ecfmvoc - create new instruements.csv, actions.csv, etc file in /shipdata/cruise_maint/ecfmvoc</h3>
<div class="outline-text-3" id="text-3-7">

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> logbook_listattr - given an elog attribute lists values assigned to that attribute during a cruise</h3>
<div class="outline-text-3" id="text-3-8">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> /shipdata/cruise_maint/ecfm_voc</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> actions.csv - actions used in ECFM configs</h3>
<div class="outline-text-3" id="text-4-1">

<p>Currently used to fillin the Action attribute in cruise logs
Created: <b>cat r2r_action_vocab.csv &gt; actions.csv</b>
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">ActionTerm</th><th scope="col" class="left">ActionID</th><th scope="col" class="left">ActionDescription</th></tr>
</thead>
<tbody>
<tr><td class="left">abort</td><td class="left">R2RE/1035</td><td class="left">Aborted device operations</td></tr>
<tr><td class="left">cruiseEnd</td><td class="left">R2RE/1036</td><td class="left">Research cruise ended</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li><b>ActionTerm</b> - term description goes here
</li>
<li>ActionID                              
</li>
<li>ActionDescription                     
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> activitytype.tsv - obsolete or still used?</h3>
<div class="outline-text-3" id="text-4-2">

<p>Obsolete? Not sure where this file came from
Created: <b>Obsolete?</b>
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">ActivityType</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">abort</td><td class="left">device sampling has been aborted</td></tr>
<tr><td class="left">abortLine</td><td class="left">research vessel has aborted a line from one station (waypoint) to another</td></tr>
<tr><td class="left">arrivePort</td><td class="left">research vessel has arrived in port</td></tr>
<tr><td class="left">calibrate</td><td class="left">device has been (re)calibrated</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>ActivityType
</li>
<li>Description
</li>
</ul>


</div>

</div>
