doc/r2r_filespecs.org
** instactionmap.csv - what actions can instruments perform?
Created:
Sample Records:
|-------------+--------------------------|
| EventTerm   | DefaultActionTerms       |
|-------------+--------------------------|
| ADCP75      | start;stop;service;other |
| ADCP150     | start;stop;service;other |
| ADCP300     | star;stop;service;other  |
| biologyPump | startSample;stopSample   |
|-------------+--------------------------|

Column Descriptions:
- EventTerm                       
- DefaultActionTerms              

** instruments.csv - instruments used in ECFM configs
Created:
Sample Records:
|-----------+--------------------------+-------------+-------------------------+-----------------------+------------------------------------------+---------------|
| DeviceID  | DeviceTerm               | DeviceCatID | DeviceCatTerm           | DefaultInstrumentTerm | DeviceDescription                        | Notes         |
|-----------+--------------------------+-------------+-------------------------+-----------------------+------------------------------------------+---------------|
| R2RE/1027 | Academic Research Vessel | R2RE/1006   | research vessel         | Ship                  | Academic Research Vessel description ... |               |
| R2RE/9011 | acqsys r2r_devtype       | R2RE/9010   | data acquisition system | Acqsys                | de/multiplexing and timetagging data ... |               |
| R2RE/9012 | adcp r2r_devtype         | L05/115     | current profilers       | ADCP                  | (acoustic doppler current profiler) ...  |               |
| R2RE/9013 | anemometer r2r_devtype   | L05/102     | meteorological packages | Anemometer            | measures wind speed and direction        | L221/TOOL0269 |
|-----------+--------------------------+-------------+-------------------------+-----------------------+------------------------------------------+---------------|

Column Descriptions:
- DeviceID :
- DeviceTerm          
- DeviceCatID
- DeviceCatTerm
- DefaultInstrumentTerm
- DeviceDescription
- Notes

** organization.tsv - organizations used in ECFM configs
Created: Copied from rvdata.us webservice
Sample Records:
|------------------+------------------------------+----------+-----------|
| OrganizationID   | Name                         | Acronym  | CountryID |
|------------------+------------------------------+----------+-----------|
| com.3phoenix     | 3Phoenix, Inc.               | 3Phoenix | us        |
| tw.edu.sinica    | Academia Sinica              | Sinica   | tw        |
| com.aecom.ensr   | AECOM/ENSR                   | ENSR     | us        |
| com.alionscience | Alion Science and Technology | Alion    | us        |
|------------------+------------------------------+----------+-----------|

Column Descriptions:
- OrganizationID              
- Name                        
- Acronym                     
- CountryID                   

** person.tsv - participants list used in ECFM configs
Created: Copied from rvdata.us webservice
Sample Records:
|----------+--------------------+------------+---------------|
| PersonID | FullName           | ShortName  | InstitutionID |
|----------+--------------------+------------+---------------|
|   100369 | Aalto, Kathryn     | kAalto     |               |
|   100370 | Aaron, Ernie       | eAaron     | SIO           |
|   102077 | Abernethy, Arreana | aAbernethy | UW            |
|----------+--------------------+------------+---------------|

Column Descriptions:
- PersonID                   
- FullName                   
- ShortName                  
- InstitutionID              

** vessel.tsv - vessels used in ECFM configs
Created: Copied from rvdata.us webservice
Sample Records:
|--------+-------------------+----------+--------------+----------+------------+-----------+---------------+-------------+-------------+--------|
| Prefix | VesselName        | ICESCode | OperatorName | CallSign | MMSINumber | Length(m) | MaxSpeed(m/s) | MaxDraft(m) | Designation | Active |
|--------+-------------------+----------+--------------+----------+------------+-----------+---------------+-------------+-------------+--------|
| HX     | Alpha Helix       | 31HX     | UAF          | WSD7078  |  368625000 |      40.5 |           5.4 |         4.2 |             | f      |
| AE     | Atlantic Explorer | 33H4     | BIOS         | WDC9417  |  303591000 |      52.1 |           5.7 |         3.4 |             | t      |
| AT     | Atlantis          | 33AT     | WHOI         | KAQP     |  367241000 |      83.5 |           7.7 |           5 | AGOR-25     | t      |
|--------+-------------------+----------+--------------+----------+------------+-----------+---------------+-------------+-------------+--------|

Column Descriptions:
- Prefix                     
- VesselName                 
- ICESCode                   
- OperatorName               
- CallSign                   
- MMSINumber                 
- Length(m)                  
- MaxSpeed(m/s)              
- MaxDraft(m)                
- Designation              
- Active
              
** termlist_actions.csv - terms to be included in actions.csv
** termlist_instruments.csv - terms to be included in instruments.csv
* /shipdata/cruise_maint/vocabs
These are R2R and NVS vocabulary terms in CSV format
Maintained by routiines vocab_nvs_get and vocab_r2r_get
** nvs_inst_vocab.csv - NVS-defined instrument terms curr used in ECFM
** nvs_action_vocab.csv - NVS-defined action terms curr used in ECFM (does not exist yet)
** r2r_inst_vocab.csv - R2R-defined instrument terms curr used in ECFM
** r2r_action_vocab.csv - R2R-defined action terms used in ECFM
