doc/r2r_filespecs.html

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> instactionmap.csv - what actions can instruments perform?</h3>
<div class="outline-text-3" id="text-4-3">

<p>Created:
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">EventTerm</th><th scope="col" class="left">DefaultActionTerms</th></tr>
</thead>
<tbody>
<tr><td class="left">ADCP75</td><td class="left">start;stop;service;other</td></tr>
<tr><td class="left">ADCP150</td><td class="left">start;stop;service;other</td></tr>
<tr><td class="left">ADCP300</td><td class="left">star;stop;service;other</td></tr>
<tr><td class="left">biologyPump</td><td class="left">startSample;stopSample</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>EventTerm                       
</li>
<li>DefaultActionTerms              
</li>
</ul>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> instruments.csv - instruments used in ECFM configs</h3>
<div class="outline-text-3" id="text-4-4">

<p>Created:
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">DeviceID</th><th scope="col" class="left">DeviceTerm</th><th scope="col" class="left">DeviceCatID</th><th scope="col" class="left">DeviceCatTerm</th><th scope="col" class="left">DefaultInstrumentTerm</th><th scope="col" class="left">DeviceDescription</th><th scope="col" class="left">Notes</th></tr>
</thead>
<tbody>
<tr><td class="left">R2RE/1027</td><td class="left">Academic Research Vessel</td><td class="left">R2RE/1006</td><td class="left">research vessel</td><td class="left">Ship</td><td class="left">Academic Research Vessel description &hellip;</td><td class="left"></td></tr>
<tr><td class="left">R2RE/9011</td><td class="left">acqsys r2r_devtype</td><td class="left">R2RE/9010</td><td class="left">data acquisition system</td><td class="left">Acqsys</td><td class="left">de/multiplexing and timetagging data &hellip;</td><td class="left"></td></tr>
<tr><td class="left">R2RE/9012</td><td class="left">adcp r2r_devtype</td><td class="left">L05/115</td><td class="left">current profilers</td><td class="left">ADCP</td><td class="left">(acoustic doppler current profiler) &hellip;</td><td class="left"></td></tr>
<tr><td class="left">R2RE/9013</td><td class="left">anemometer r2r_devtype</td><td class="left">L05/102</td><td class="left">meteorological packages</td><td class="left">Anemometer</td><td class="left">measures wind speed and direction</td><td class="left">L221/TOOL0269</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>DeviceID :
</li>
<li>DeviceTerm          
</li>
<li>DeviceCatID
</li>
<li>DeviceCatTerm
</li>
<li>DefaultInstrumentTerm
</li>
<li>DeviceDescription
</li>
<li>Notes
</li>
</ul>


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> organization.tsv - organizations used in ECFM configs</h3>
<div class="outline-text-3" id="text-4-5">

<p>Created: Copied from rvdata.us webservice
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">OrganizationID</th><th scope="col" class="left">Name</th><th scope="col" class="left">Acronym</th><th scope="col" class="left">CountryID</th></tr>
</thead>
<tbody>
<tr><td class="left">com.3phoenix</td><td class="left">3Phoenix, Inc.</td><td class="left">3Phoenix</td><td class="left">us</td></tr>
<tr><td class="left">tw.edu.sinica</td><td class="left">Academia Sinica</td><td class="left">Sinica</td><td class="left">tw</td></tr>
<tr><td class="left">com.aecom.ensr</td><td class="left">AECOM/ENSR</td><td class="left">ENSR</td><td class="left">us</td></tr>
<tr><td class="left">com.alionscience</td><td class="left">Alion Science and Technology</td><td class="left">Alion</td><td class="left">us</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>OrganizationID              
</li>
<li>Name                        
</li>
<li>Acronym                     
</li>
<li>CountryID                   
</li>
</ul>


</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> person.tsv - participants list used in ECFM configs</h3>
<div class="outline-text-3" id="text-4-6">

<p>Created: Copied from rvdata.us webservice
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">PersonID</th><th scope="col" class="left">FullName</th><th scope="col" class="left">ShortName</th><th scope="col" class="left">InstitutionID</th></tr>
</thead>
<tbody>
<tr><td class="right">100369</td><td class="left">Aalto, Kathryn</td><td class="left">kAalto</td><td class="left"></td></tr>
<tr><td class="right">100370</td><td class="left">Aaron, Ernie</td><td class="left">eAaron</td><td class="left">SIO</td></tr>
<tr><td class="right">102077</td><td class="left">Abernethy, Arreana</td><td class="left">aAbernethy</td><td class="left">UW</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>PersonID                   
</li>
<li>FullName                   
</li>
<li>ShortName                  
</li>
<li>InstitutionID              
</li>
</ul>


</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> vessel.tsv - vessels used in ECFM configs</h3>
<div class="outline-text-3" id="text-4-7">

<p>Created: Copied from rvdata.us webservice
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Prefix</th><th scope="col" class="left">VesselName</th><th scope="col" class="left">ICESCode</th><th scope="col" class="left">OperatorName</th><th scope="col" class="left">CallSign</th><th scope="col" class="right">MMSINumber</th><th scope="col" class="right">Length(m)</th><th scope="col" class="right">MaxSpeed(m/s)</th><th scope="col" class="right">MaxDraft(m)</th><th scope="col" class="left">Designation</th><th scope="col" class="left">Active</th></tr>
</thead>
<tbody>
<tr><td class="left">HX</td><td class="left">Alpha Helix</td><td class="left">31HX</td><td class="left">UAF</td><td class="left">WSD7078</td><td class="right">368625000</td><td class="right">40.5</td><td class="right">5.4</td><td class="right">4.2</td><td class="left"></td><td class="left">f</td></tr>
<tr><td class="left">AE</td><td class="left">Atlantic Explorer</td><td class="left">33H4</td><td class="left">BIOS</td><td class="left">WDC9417</td><td class="right">303591000</td><td class="right">52.1</td><td class="right">5.7</td><td class="right">3.4</td><td class="left"></td><td class="left">t</td></tr>
<tr><td class="left">AT</td><td class="left">Atlantis</td><td class="left">33AT</td><td class="left">WHOI</td><td class="left">KAQP</td><td class="right">367241000</td><td class="right">83.5</td><td class="right">7.7</td><td class="right">5</td><td class="left">AGOR-25</td><td class="left">t</td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><ul>
<li>Prefix                     
</li>
<li>VesselName                 
</li>
<li>ICESCode                   
</li>
<li>OperatorName               
</li>
<li>CallSign                   
</li>
<li>MMSINumber                 
</li>
<li>Length(m)                  
</li>
<li>MaxSpeed(m/s)              
</li>
<li>MaxDraft(m)                
</li>
<li>Designation              
</li>
<li>Active
</li>
</ul>


</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> termlist_actions.csv - terms to be included in actions.csv</h3>
<div class="outline-text-3" id="text-4-8">

</div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> termlist_instruments.csv - terms to be included in instruments.csv</h3>
<div class="outline-text-3" id="text-4-9">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> /shipdata/cruise_maint/vocabs</h2>
<div class="outline-text-2" id="text-5">

<p>These are R2R and NVS vocabulary terms in CSV format
Maintained by routiines vocab_nvs_get and vocab_r2r_get
</p>
</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> nvs_inst_vocab.csv - NVS-defined instrument terms curr used in ECFM</h3>
<div class="outline-text-3" id="text-5-1">

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> nvs_action_vocab.csv - NVS-defined action terms curr used in ECFM (does not exist yet)</h3>
<div class="outline-text-3" id="text-5-2">

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> r2r_inst_vocab.csv - R2R-defined instrument terms curr used in ECFM</h3>
<div class="outline-text-3" id="text-5-3">

</div>

</div>
