doc/r2r_filespecs.org
** r2r_person_vocab.csv - R2R-defined people terms used in ECFM
* Vocabulary term candidate files 
Entries in R2R logbooks not yet entered into NVS or R2R vocabularies
** nvs_inst_candidates.csv
Same format as instruments.csv
** nvs_action_candidates.csv
Same format as actions.csv
** r2r_inst_candidates.csv
Same format as instruments.csv
** r2r_action_candidates.csv
** r2r_person_candidates.csv
** r2r_organization_candidates.csv
** r2r_instactionmap_candidates.csv
* /shipdata/cruise_maint/cruises/<cruiseid>
Files found in cruises/<cruiseid> subdirectory
** elogd.cfg - latest cruise elogd.cfg
Copied from cruise distribution, in elog.cfg format
** ecfm_cruisemeta.csv - cruise metadata from elogd.cfg
Cruise metadata extracted from elogd.cfg
Created:
Sample Records:
|----------+----------------+-------+------+------+-----+-------+-------+------|
| cruiseid | ship           | three | four | five | six | seven | eight | nine |
|----------+----------------+-------+------+------+-----+-------+-------+------|
| al130801 | R/V M/Y Alucia |       |      |      |     |       |       |      |
|----------+----------------+-------+------+------+-----+-------+-------+------|

Column Descriptions:
|----------------+-------------|
| Header         | Description |
|----------------+-------------|
|----------------+-------------|
** ecfm_instruments.csv - instruments from elogd.cfg
Instruments extracted from elogd.cfg
Created:
Sample Records:
|-----------+--------------------------+-------------+-----------------+-----------------------+------------------------------------------------+--------------+---------------------------------------+-------|
| DeviceID  | DeviceTerm               | DeviceCatID | DeviceCatTerm   | DefaultInstrumentTerm | DeviceDescription                              | AttrNameUsed | ActionsUsed                           | State |
|-----------+--------------------------+-------------+-----------------+-----------------------+------------------------------------------------+--------------+---------------------------------------+-------|
| R2RE/1027 | Academic Research Vessel | R2RE/1006   | research vessel | Ship                  | Academic Research Vessel description goes here | Ship         | startCruise;endCruise;other           |     0 |
| R2RE/1057 | F185_MRU                 | R2RE/1010   | user specified  | UserSpecified         | Coda Octopus F185+ Motion Reference Unit       | F185         | startCalibration;endCalibration;other |     3 |
|-----------+--------------------------+-------------+-----------------+-----------------------+------------------------------------------------+--------------+---------------------------------------+-------|
Column Descriptions:
|----------------+-------------|
| Header         | Description |
|----------------+-------------|
|----------------+-------------|
** ecfm_actions.csv - actions from elogd.cfg
Actions extracted from elogd.cfg
Created:
Sample Records:

Column Descriptions:
|----------------+-------------|
| Header         | Description |
|----------------+-------------|
|----------------+-------------|
** ecfm_person.csv - persons from elogd.cfg
Persons extracted from elogd.cfg
Created:
Sample Records:

Column Descriptions:
|----------------+-------------|
| Header         | Description |
|----------------+-------------|
|----------------+-------------|
** novoc_actions.csv - actions not in NVS or R2R vocabs
** novoc_instruments.csv - instruments in NVS or R2R vocabs
