doc/r2r_filespecs.html

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> r2r_action_vocab.csv - R2R-defined action terms used in ECFM</h3>
<div class="outline-text-3" id="text-5-4">

</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> r2r_person_vocab.csv - R2R-defined people terms used in ECFM</h3>
<div class="outline-text-3" id="text-5-5">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Vocabulary term candidate files</h2>
<div class="outline-text-2" id="text-6">

<p>Entries in R2R logbooks not yet entered into NVS or R2R vocabularies
</p>
</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> nvs_inst_candidates.csv</h3>
<div class="outline-text-3" id="text-6-1">

<p>Same format as instruments.csv
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> nvs_action_candidates.csv</h3>
<div class="outline-text-3" id="text-6-2">

<p>Same format as actions.csv
</p></div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> r2r_inst_candidates.csv</h3>
<div class="outline-text-3" id="text-6-3">

<p>Same format as instruments.csv
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> r2r_action_candidates.csv</h3>
<div class="outline-text-3" id="text-6-4">

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> r2r_person_candidates.csv</h3>
<div class="outline-text-3" id="text-6-5">

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> r2r_organization_candidates.csv</h3>
<div class="outline-text-3" id="text-6-6">

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> r2r_instactionmap_candidates.csv</h3>
<div class="outline-text-3" id="text-6-7">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> /shipdata/cruise_maint/cruises/&lt;cruiseid&gt;</h2>
<div class="outline-text-2" id="text-7">

<p>Files found in cruises/&lt;cruiseid&gt; subdirectory
</p>
</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> elogd.cfg - latest cruise elogd.cfg</h3>
<div class="outline-text-3" id="text-7-1">

<p>Copied from cruise distribution, in elog.cfg format
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> ecfm_cruisemeta.csv - cruise metadata from elogd.cfg</h3>
<div class="outline-text-3" id="text-7-2">

<p>Cruise metadata extracted from elogd.cfg
Created:
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">cruiseid</th><th scope="col" class="left">ship</th><th scope="col" class="left">three</th><th scope="col" class="left">four</th><th scope="col" class="left">five</th><th scope="col" class="left">six</th><th scope="col" class="left">seven</th><th scope="col" class="left">eight</th><th scope="col" class="left">nine</th></tr>
</thead>
<tbody>
<tr><td class="left">al130801</td><td class="left">R/V M/Y Alucia</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>


<p>
Column Descriptions:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Header</th><th scope="col" class="left">Description</th></tr>
</thead>
</table>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> ecfm_instruments.csv - instruments from elogd.cfg</h3>
<div class="outline-text-3" id="text-7-3">

<p>Instruments extracted from elogd.cfg
Created:
Sample Records:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">DeviceID</th><th scope="col" class="left">DeviceTerm</th><th scope="col" class="left">DeviceCatID</th><th scope="col" class="left">DeviceCatTerm</th><th scope="col" class="left">DefaultInstrumentTerm</th><th scope="col" class="left">DeviceDescription</th><th scope="col" class="left">AttrNameUsed</th><th scope="col" class="left">ActionsUsed</th><th scope="col" class="right">State</th></tr>
</thead>
<tbody>
<tr><td class="left">R2RE/1027</td><td class="left">Academic Research Vessel</td><td class="left">R2RE/1006</td><td class="left">research vessel</td><td class="left">Ship</td><td class="left">Academic Research Vessel description goes here</td><td class="left">Ship</td><td class="left">startCruise;endCruise;other</td><td class="right">0</td></tr>
<tr><td class="left">R2RE/1057</td><td class="left">F185_MRU</td><td class="left">R2RE/1010</td><td class="left">user specified</td><td class="left">UserSpecified</td><td class="left">Coda Octopus F185+ Motion Reference Unit</td><td class="left">F185</td><td class="left">startCalibration;endCalibration;other</td><td class="right">3</td></tr>
</tbody>
</table>

Column Descriptions:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Header</th><th scope="col" class="left">Description</th></tr>
</thead>
</table>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> ecfm_actions.csv - actions from elogd.cfg</h3>
<div class="outline-text-3" id="text-7-4">

<p>Actions extracted from elogd.cfg
Created:
Sample Records:
</p>
<p>
Column Descriptions:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Header</th><th scope="col" class="left">Description</th></tr>
</thead>
</table>

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> ecfm_person.csv - persons from elogd.cfg</h3>
<div class="outline-text-3" id="text-7-5">

<p>Persons extracted from elogd.cfg
Created:
Sample Records:
</p>
<p>
Column Descriptions:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Header</th><th scope="col" class="left">Description</th></tr>
</thead>
</table>

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> novoc_actions.csv - actions not in NVS or R2R vocabs</h3>
<div class="outline-text-3" id="text-7-6">

</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> novoc_instruments.csv - instruments in NVS or R2R vocabs</h3>
<div class="outline-text-3" id="text-7-7">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-14T07:33-0500</p>
<p class="author">Author: Drumbeat</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
